[
  {
    "path": "posts/2021-05-26-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Recasting Visualisation To Better Illuminate Underlying Insights \n(Using Data From Singapore’s Department Of Statistics)",
    "author": [
      {
        "name": "Syed Ahmad Zaki",
        "url": "https://www.google.com/"
      }
    ],
    "date": "2021-05-26",
    "categories": [],
    "contents": "\r\n1. Makeover Requirements\r\n1.1. The Task\r\nCritic the visualized graph with at least three points from each evaluation criterion (clarity and aesthetics) respectively\r\nSuggest alternative graphical presentation to improve the current design\r\nProposed alternative data visualization must be in static form\r\nProposed design would need to be sketched\r\nSupport your design by describing the advantages or which part of the issue(s) your alternative design attempts to overcome\r\nUse Tableau to design the proposed data visualization\r\nProvide step-by-step description on how the data visualization was prepared\r\nDescribe three major observations revealed by the prepared data visualization\r\n1.2. Deliverables\r\nThe write-up of the DataViz Makeover must be in distill or blogdown format, and is required to publish the write-up on Netlify\r\nThe DataViz Makeover must be prepared using Tableau Desktop. The final workbook must be uploaded onto Tableau Public\r\n2. Original Visualisation and Its Perceived Objective\r\nThe original visualization (shown below) showcases the merchandise trade of the top six trading countries across 2019 to 2020.\r\nFigure 1: Original Data VisualisationTo better understand how best to recast this visualization, we must first understand the intent of the visualization. Alberto Cairo succinctly sums the intent up as what the graphic is for: what do you want people to see. He went to explain that one should begin not by designing the graphic but begin by writing a very long narrative that you want to tell.\r\nOur attempt on the narrative for the above visualization is as follows:\r\n“The import and export fluctuations across our top six trading countries differ greatly between 2019 to 2020, as well as against the other top trading countries.”\r\nTo further illuminate the narrative, we propose questions that the visualization aims to answer: • What are the import and export levels in each of the top six trading countries?\r\n• How do these import and export levels fluctuate over time?\r\n• Within the top six countries, who has the highest and lowest import and export levels respectively?\r\n• (Additional) Do these fluctuations coincide with any event?\r\n3. Critiquing Methodology\r\nWe attempt to critique the above visualization on two criterions: clarity and aesthetics. Ben Jones (2012) nicely captured these criterions within a two-by-two matrix. The ideal quadrant to be in is Quadrant I, where it is both clear and beautiful.\r\nFigure 2: Data Visualization Matrix: Clarity vs AestheticsFrom a definition perspective, aesthetics refers to how pleasing the visualization is to the reader’s eye, while clarity refers to how clear and concise the story or the message behind the visualization is conveyed to the reader.\r\n4. Critique of Visualisation\r\n5. Alternative Design\r\n6. Step-by-Step Guide\r\n6.1. Data Preparation\r\nThe original raw data reside within the following links: Merchandise Trade Webpage and Merchandise Trade Excel Download\r\nThe Excel file contains the following three sheets:\r\n\r\n\r\nTable 1: Contents of Merchandise Trade Excel File\r\n\r\n\r\nSheet_Name\r\n\r\n\r\nDescription\r\n\r\n\r\nContent\r\n\r\n\r\nExplaining sheets T1 and T2 contain the “Merchandise Imports By Region/Market, Monthly” and “Merchandise Exports By Region/Market, Monthly” respectively\r\n\r\n\r\nT1\r\n\r\n\r\nContains the monthly merchandise imports by country/region in dollars (thousands for individual countries or millions for regions) spanning Jan-1976 to Apr-2021\r\n\r\n\r\nT2\r\n\r\n\r\nContains the monthly merchandise exports by country/region in dollars (thousands for individual countries or millions for regions) spanning Jan-1976 to Apr-2021\r\n\r\n\r\nWe will now utilize Microsoft Excel and Tableau Desktop for the data preparation and visualization respectively.\r\n\r\n\r\nNo. \r\n\r\n\r\nData_Prep_Steps\r\n\r\n\r\nScreenshots\r\n\r\n\r\n1\r\n\r\n\r\nUsing Microsoft Excel file, open the raw data (outputFile.xlsx).\r\n\r\n\r\n\r\n\r\n2\r\n\r\n\r\nIn spreadsheet T1, remove the first 5 rows. Repeat step in spreadsheet T2.\r\n\r\n\r\n\r\n\r\n3\r\n\r\n\r\nRemove rows 2 to 8 in both spreadsheet T1 and T2.\r\n\r\n\r\n\r\n\r\n4\r\n\r\n\r\nRemove rows 115 to 128 in spreadsheet T1. Similarly, remove rows 87 to 100 in T2.\r\n\r\n\r\n\r\n\r\n5\r\n\r\n\r\nSince the visualization was based on data from 2019 onwards, remove columns B to SW in both spreadsheet T1 and T2.\r\n\r\n\r\n\r\n\r\n6\r\n\r\n\r\nSince the dates in row 1 are not in proper date format, reformat dates to the first of the month from Jan-2019 onwards. Similarly, do this step on spreadsheet T2. Then rename cell A1 to Country.\r\n\r\n\r\n\r\n\r\n7\r\n\r\n\r\nInsert a column in column B and name it “Type”. Then fill the column with the value “Import”.Insert a similar column in T2 but fill the column with the value “Export”.\r\n\r\n\r\n\r\n\r\n8\r\n\r\n\r\nFrom the Data ribbon, select the button “From Table/Range”.\r\n\r\n\r\n\r\n\r\n9\r\n\r\n\r\nEnsure that $A\\(1:\\)AD$114 is selected and click OK. A Power Query Editor program will then launch.\r\n\r\n\r\n\r\n\r\n10\r\n\r\n\r\nHighlight the first two columns (Country and Type), and then within the Transform ribbon, select Unpivot Other Columns.\r\n\r\n\r\n\r\n\r\n11\r\n\r\n\r\nRename the third and fourth column to Period and Trade_Amt.\r\n\r\n\r\n\r\n\r\n12\r\n\r\n\r\nTo load the results back into Excel, within the Home (tab), select Close & Load.\r\n\r\n\r\n\r\n\r\n13\r\n\r\n\r\nTo only extract the country name in the first column, insert a column and then use the following formula: “=TRIM(LEFT([@Country],SEARCH(”(“,[@Country])-1))”. To keep these values, copy and paste back these same values only.\r\n\r\n\r\n\r\n\r\n14\r\n\r\n\r\nRemove column A with the old values. Rename the header of the latest column A to Country.\r\n\r\n\r\n\r\n\r\n15\r\n\r\n\r\nRepeat steps 8 to 14 for sheet T2.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-26T01:44:41+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My DataViz Makeover Page",
    "description": "Welcome to my humble abode, where we delve into data vizualisation makeovers. We hope you enjoy reading what we have to say!",
    "author": [
      {
        "name": "Syed Ahmad Zaki",
        "url": "https://www.google.com/"
      }
    ],
    "date": "2021-05-24",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-26T00:00:04+08:00",
    "input_file": {}
  }
]
